[
  {
    "id": "rm_explainer_third_man_run",
    "namespace": "historic_knowledge",
    "text": "A third-man run is an off-ball movement where a player exploits space created after two players combine. Real Madrid frequently use third-man runs from midfielders like Valverde or Bellingham to break compact defensive lines.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "third_man_run"
    }
  },
  {
    "id": "rm_explainer_triangle_combinations",
    "namespace": "historic_knowledge",
    "text": "Triangle combinations allow Real Madrid to create stable passing lanes and maintain fluid rhythm during possession. These patterns enable quick switches, penetrative passes, and unpredictable rotations.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "triangle_combinations"
    }
  },
  {
    "id": "rm_explainer_half_space_rotation",
    "namespace": "historic_knowledge",
    "text": "Half-space rotations involve switching positions between forwards and midfielders to disorganize opponents. Real Madrid employ these rotations to create shooting lanes and disguise attacking runs.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "half_space_rotations"
    }
  },
  {
    "id": "rm_defensive_identity_central_protection",
    "namespace": "historic_knowledge",
    "text": "Central protection is a defensive principle where Real Madrid ensure the midfield and center-backs shield the central lanes. This prevents dangerous passes into the box and funnels opponents wide.",
    "metadata": {
      "type": "defensive_identity",
      "topic": "central_protection"
    }
  },
  {
    "id": "rm_defensive_identity_backward_press",
    "namespace": "historic_knowledge",
    "text": "Backward pressing involves attackers pressing back after the ball passes them. Real Madrid use backward press from forwards to collapse the midfield around the ball carrier.",
    "metadata": {
      "type": "defensive_identity",
      "topic": "backward_press"
    }
  },
  {
    "id": "rm_structure_double_pivot",
    "namespace": "historic_knowledge",
    "text": "Real Madrid sometimes operate with a double pivot to stabilize possession and improve rest defense. Camavinga, Kroos, and Tchouaméni often form these partnerships depending on match needs.",
    "metadata": {
      "type": "tactical_structure",
      "topic": "double_pivot"
    }
  },
  {
    "id": "rm_explainer_box_midfield",
    "namespace": "historic_knowledge",
    "text": "A box midfield provides numerical superiority in central zones. Real Madrid use this structure to dominate possession and control transitions through stable positioning between four midfielders.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "box_midfield"
    }
  },
  {
    "id": "rm_explainer_false_fullback",
    "namespace": "historic_knowledge",
    "text": "A false fullback moves inside rather than overlapping, aiding buildup and rest defense. Real Madrid employ this role to stabilize transitions and provide an extra passing option.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "false_fullback"
    }
  },
  {
    "id": "rm_explainer_staggered_midfield",
    "namespace": "historic_knowledge",
    "text": "A staggered midfield creates height differences between players, enabling smoother ball progression. Real Madrid use staggered shapes to break lines and coordinate vertical passes.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "staggered_midfield"
    }
  },
  {
    "id": "rm_explainer_gegenpress_triggers",
    "namespace": "historic_knowledge",
    "text": "Counter-pressing triggers include poor touches, backward passes, and isolated opponents. Real Madrid apply selective gegenpressing, particularly after high recoveries by midfielders.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "gegenpress_triggers"
    }
  },
  {
    "id": "rm_explainer_ball_far_winger_role",
    "namespace": "historic_knowledge",
    "text": "The ball-far winger stays wide and ready to exploit switches. Real Madrid’s attackers often remain aggressive on the weak side to attack open space after diagonal passes.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "ball_far_winger"
    }
  },
  {
    "id": "rm_explainer_positional_superiority",
    "namespace": "historic_knowledge",
    "text": "Positional superiority is achieved when attackers occupy more valuable spaces than defenders. Real Madrid’s midfielders seek this through interior positioning and dynamic receiving angles.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "positional_superiority"
    }
  },
  {
    "id": "rm_team_culture_comeback_mentality",
    "namespace": "historic_knowledge",
    "text": "Real Madrid are famous for their comeback mentality, often maintaining belief and intensity even when behind. This cultural trait forms a psychological advantage in high-stress matches.",
    "metadata": {
      "type": "club_culture",
      "theme": "comeback_mentality"
    }
  },
  {
    "id": "rm_explainer_zonal_marking",
    "namespace": "historic_knowledge",
    "text": "Zonal marking assigns space rather than individual opponents. Real Madrid frequently combine zonal shapes with situational man-marking to maintain defensive compactness.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "zonal_marking"
    }
  },
  {
    "id": "rm_explainer_man_marking_traps",
    "namespace": "historic_knowledge",
    "text": "Man-marking traps draw opponents into specific areas before collapsing pressure. Real Madrid use these traps in wide zones to regain possession quickly.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "man_marking_traps"
    }
  },
  {
    "id": "rm_explainer_low_crosses",
    "namespace": "historic_knowledge",
    "text": "Low crosses target runners arriving inside the box and are commonly generated after wide overloads. Real Madrid’s wingers and fullbacks regularly use low crosses to create high-xG chances.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "low_cross"
    }
  },
  {
    "id": "rm_buildup_back_three",
    "namespace": "historic_knowledge",
    "text": "Real Madrid often form a back three during buildup, either through a fullback dropping or a midfielder sliding deep. This provides stability, width, and better angles for progression.",
    "metadata": {
      "type": "tactical_structure",
      "topic": "back_three_buildup"
    }
  },
  {
    "id": "rm_explainer_between_lines_play",
    "namespace": "historic_knowledge",
    "text": "Playing between the lines involves receiving passes in pockets between midfield and defense. Real Madrid’s attacking midfielders excel at exploiting these pockets to create goal-scoring actions.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "between_lines_play"
    }
  },
  {
    "id": "rm_player_guler_profile",
    "namespace": "historic_knowledge",
    "text": "Arda Güler is a technically gifted attacking midfielder known for close control, creativity, and playmaking in tight spaces. His left foot allows him to break defensive lines with disguised passes and curled shots.",
    "metadata": {
      "type": "player_profile",
      "player_name": "Arda Güler",
      "primary_position": "Attacking Midfielder",
      "roles": ["playmaker", "creative midfielder"]
    }
  },
  {
    "id": "rm_explainer_through_balls",
    "namespace": "historic_knowledge",
    "text": "Through balls are vertical passes played into runs behind the defensive line. Real Madrid frequently use through balls to exploit the pace of their forwards in transition.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "through_balls"
    }
  },
  {
    "id": "rm_explainer_vertical_halfspace_runs",
    "namespace": "historic_knowledge",
    "text": "Vertical half-space runs create channels between defenders. Real Madrid's attackers frequently time these runs to receive progressive passes in stride.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "vertical_halfspace_runs"
    }
  },
  {
    "id": "rm_defensive_identity_restoring_shape",
    "namespace": "historic_knowledge",
    "text": "Restoring shape refers to how quickly a team resets defensive structure after losing possession. Real Madrid emphasize quick compactness from midfielders to reduce counter-attack danger.",
    "metadata": {
      "type": "defensive_identity",
      "topic": "restoring_shape"
    }
  },
  {
    "id": "rm_possession_identity_shoulders_open",
    "namespace": "historic_knowledge",
    "text": "Playing with open shoulders enables players to scan and receive forward-facing. Real Madrid midfielders are coached to angle their bodies to facilitate rapid forward progression.",
    "metadata": {
      "type": "tactical_identity",
      "topic": "body_orientation"
    }
  },
  {
    "id": "rm_explainer_spread_and_attack",
    "namespace": "historic_knowledge",
    "text": "Spread and attack involves stretching the pitch horizontally before accelerating into central spaces. Real Madrid employ this principle to create isolation for their wingers.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "spread_and_attack"
    }
  },
  {
    "id": "rm_explainer_five_lanes",
    "namespace": "historic_knowledge",
    "text": "The five-lane principle divides the field into five vertical channels. Real Madrid maintain spacing across these lanes to optimize occupation, passing angles, and overload creation.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "five_lanes"
    }
  },
  {
    "id": "rm_explainer_sweeper_keeper_role",
    "namespace": "historic_knowledge",
    "text": "A sweeper-keeper extends defensive coverage by intercepting long balls and supporting buildup. Real Madrid goalkeepers use this role situationally depending on opponent pressure.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "sweeper_keeper"
    }
  },
  {
    "id": "rm_identity_champions_league_dna",
    "namespace": "historic_knowledge",
    "text": "Real Madrid’s Champions League identity is built on composure, experience, and decisive moments. Their players excel under pressure and thrive in continental knockout formats.",
    "metadata": {
      "type": "club_identity",
      "theme": "ucl_dna"
    }
  },
  {
    "id": "rm_explainer_midfield_box_to_box_role",
    "namespace": "historic_knowledge",
    "text": "A box-to-box role covers both defensive and attacking transitions. Real Madrid use these profiles to link phases and increase intensity in central areas.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "box_to_box_role"
    }
  },
  {
    "id": "rm_explainer_blind_side_run",
    "namespace": "historic_knowledge",
    "text": "Blind-side runs occur when attackers enter space behind defenders' field of vision. Real Madrid’s wide attackers use blind-side runs to exploit defensive lapses.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "blind_side_run"
    }
  },
  {
    "id": "rm_explainer_closing_halfspaces_defensively",
    "namespace": "historic_knowledge",
    "text": "Closing half-spaces defensively prevents opponents from accessing dangerous areas. Real Madrid frequently tighten central channels to force opponents wide.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "closing_halfspaces"
    }
  },
  {
    "id": "rm_explainer_recycle_possession",
    "namespace": "historic_knowledge",
    "text": "Recycling possession helps reset structure and maintain control when forward options are limited. Real Madrid often recycle through midfielders and centre-backs to reposition attackers.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "recycle_possession"
    }
  },
  {
    "id": "rm_explainer_cover_shadow",
    "namespace": "historic_knowledge",
    "text": "Cover shadows block passing lanes while pressing. Real Madrid attackers use cover shadows to guide buildup into predictable areas before applying pressure.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "cover_shadow"
    }
  },
  {
    "id": "rm_explainer_underloaded_side_reset",
    "namespace": "historic_knowledge",
    "text": "An underloaded side reset involves moving the ball away from congested areas to reorganize attacking shape. Real Madrid use this to reset rhythm and switch play effectively.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "underloaded_side_reset"
    }
  },
  {
    "id": "rm_identity_squad_depth_advantage",
    "namespace": "historic_knowledge",
    "text": "Real Madrid's depth enables rotational flexibility and tactical variation. Squad depth allows the team to maintain intensity throughout long seasons across multiple competitions.",
    "metadata": {
      "type": "club_identity",
      "theme": "squad_depth"
    }
  },
  {
    "id": "rm_explainer_hold_up_play",
    "namespace": "historic_knowledge",
    "text": "Hold-up play involves forwards receiving with their back to goal and protecting the ball until support arrives. Real Madrid use this technique to maintain possession and enable overlapping runs.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "hold_up_play"
    }
  },
  {
    "id": "rm_explainer_cut_inside_role",
    "namespace": "historic_knowledge",
    "text": "A cut-inside role involves wide attackers driving inward to shoot or create. Real Madrid’s wingers frequently cut inside to combine with midfielders or attack the box.",
    "metadata": {
      "type": "tactical_explainer",
      "topic": "cut_inside"
    }
  }
]
